Revit 2024 API
AssetPropertyFloat Class
 Represents a property of material.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class AssetPropertyFloat : AssetProperty
Visual Basic
Public Class AssetPropertyFloat _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyFloat : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyFloat
See Also
AssetPropertyFloat Members
Autodesk.Revit.DB.Visual Namespace